---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheetType.CreateDefaultFabricSheetType(Autodesk.Revit.DB.Document)
source: html/20f37de8-a912-d25c-e16e-aa89256e2e90.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.CreateDefaultFabricSheetType Method

Creates a new FabricSheetType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultFabricSheetType(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null